; domain
(define (domain vlmrobobench)
  (:requirements :strips :typing)
  (:types
    cube cloth plate bowl mat paper - object
    purple-cube blue-cube orange-cube yellow-cube green-cube - cube
    pink-plate cream-plate cyan-plate - plate
  )
  (:predicates
    (on-top-of ?o1 - object ?o2 - object)
    (hand-empty)
    (holding ?o - object)
    (clear ?o - object)
  )

  (:action pick
    :parameters (?obj - object ?underobj - object)
    :precondition (and
      (hand-empty)
      (clear ?obj)
      (on-top-of ?obj ?underobj)
    )
    :effect (and
      (holding ?obj)
      (clear ?underobj)
      (not (hand-empty))
      (not (on-top-of ?obj ?underobj))
      (not (clear ?obj))
    )
  )

  (:action place-on-object
    :parameters (?obj - object ?target - object)
    :precondition (and
      (holding ?obj)
      (clear ?target)
    )
    :effect (and
      (on-top-of ?obj ?target)
      (hand-empty)
      (clear ?obj)
      (not (clear ?target))
      (not (holding ?obj))
    )
  )
)

; problem
(define (problem vlmrobobench-stack-cubes-on-pink-plate)
  (:domain vlmrobobench)

  (:objects
    orange-cube-1 - orange-cube
    yellow-cube-1 - yellow-cube
    green-cube-1 - green-cube
    blue-cube-1 - blue-cube
    pink-plate-1 - pink-plate
    cream-plate-1 - cream-plate
    cyan-plate-1 - cyan-plate
  )

  (:init
    (on-top-of blue-cube-1 cream-plate-1)
    (on-top-of yellow-cube-1 blue-cube-1)
    (on-top-of orange-cube-1 cyan-plate-1)
    (on-top-of green-cube-1 orange-cube-1)
    (clear yellow-cube-1)
    (clear green-cube-1)
    (clear pink-plate-1)
    (hand-empty)
  )

  (:goal
    (and
      (on-top-of orange-cube-1 pink-plate-1)
      (on-top-of yellow-cube-1 orange-cube-1)
      (on-top-of green-cube-1 yellow-cube-1)
      (on-top-of blue-cube-1 green-cube-1)
    )
  )
)

; plan
1. (pick green-cube-1 orange-cube-1)
   deleted: (hand-empty) (on-top-of green-cube-1 orange-cube-1) (clear green-cube-1)
   added: (holding green-cube-1) (clear orange-cube-1)
   goals met: 0 of 4
2. (place-on-object green-cube-1 yellow-cube-1)
   deleted: (clear yellow-cube-1) (holding green-cube-1)
   added: (on-top-of green-cube-1 yellow-cube-1) (hand-empty) (clear green-cube-1)
   goals met: 1 of 4
3. (pick orange-cube-1 cyan-plate-1)
   deleted: (hand-empty) (on-top-of orange-cube-1 cyan-plate-1) (clear orange-cube-1)
   added: (holding orange-cube-1) (clear cyan-plate-1)
   goals met: 1 of 4
4. (place-on-object orange-cube-1 pink-plate-1)
   deleted: (clear pink-plate-1) (holding orange-cube-1)
   added: (on-top-of orange-cube-1 pink-plate-1) (hand-empty) (clear orange-cube-1)
   goals met: 2 of 4
5. (pick green-cube-1 yellow-cube-1)
   deleted: (hand-empty) (on-top-of green-cube-1 yellow-cube-1) (clear green-cube-1)
   added: (holding green-cube-1) (clear yellow-cube-1)
   goals met: 1 of 4
6. (place-on-object green-cube-1 cyan-plate-1)
   deleted: (clear cyan-plate-1) (holding green-cube-1)
   added: (on-top-of green-cube-1 cyan-plate-1) (hand-empty) (clear green-cube-1)
   goals met: 1 of 4
7. (pick yellow-cube-1 blue-cube-1)
   deleted: (hand-empty) (on-top-of yellow-cube-1 blue-cube-1) (clear yellow-cube-1)
   added: (holding yellow-cube-1) (clear blue-cube-1)
   goals met: 1 of 4
8. (place-on-object yellow-cube-1 orange-cube-1)
   deleted: (clear orange-cube-1) (holding yellow-cube-1)
   added: (on-top-of yellow-cube-1 orange-cube-1) (hand-empty) (clear yellow-cube-1)
   goals met: 2 of 4
9. (pick green-cube-1 cyan-plate-1)
   deleted: (hand-empty) (on-top-of green-cube-1 cyan-plate-1) (clear green-cube-1)
   added: (holding green-cube-1) (clear cyan-plate-1)
   goals met: 2 of 4
10. (place-on-object green-cube-1 yellow-cube-1)
   deleted: (clear yellow-cube-1) (holding green-cube-1)
   added: (on-top-of green-cube-1 yellow-cube-1) (hand-empty) (clear green-cube-1)
   goals met: 3 of 4
11. (pick blue-cube-1 cream-plate-1)
   deleted: (hand-empty) (on-top-of blue-cube-1 cream-plate-1) (clear blue-cube-1)
   added: (holding blue-cube-1) (clear cream-plate-1)
   goals met: 3 of 4
12. (place-on-object blue-cube-1 green-cube-1)
   deleted: (clear green-cube-1) (holding blue-cube-1)
   added: (on-top-of blue-cube-1 green-cube-1) (hand-empty) (clear blue-cube-1)
   goals met: 4 of 4
